trunk/fireFoam/testBatteryFireFOAM/wallFireSpread2D/0/p_rgh
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    wall           
    {
//	type			fixedFluxBuoyantPressure;
	type			buoyantPressure;
	value			$internalField;
    }

    outlet          
    {
	type			zeroGradient;
    }

    ground           
    {
	type			zeroGradient;
	//type			buoyantPressure;
	//value			$internalField;
    }

    side          
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           0;//1.4;
	p0	        $internalField;
	value		$internalField;
    }

    frontAndBack    
    {
        type            empty;
    }

    burner          
    {
        type            zeroGradient;
    }
    region0_to_panelRegion_panel
    {
//	type			fixedFluxBuoyantPressure;
	type			buoyantPressure;
	value			$internalField;
    }
}


// ************************************************************************* //
