trunk/fireFoam/testBatteryFireFOAM/wallFireSpread2D/0/panelRegion/Y0Default
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    panel_top
    {
        type            zeroGradient;
    }
    region0_to_panelRegion_panel
    {
        type            zeroGradient;
    }
    panel_side
    {
	type empty;
    }

}


// ************************************************************************* //
