trunk/fireFoam/testBatteryFireFOAM/wallFireSpread2D/constant/thermo.compressibleGas
(
O2 O2   1   31.9988
    200 5000    1000
    3.69758 0.00061352 -1.25884e-07 1.77528e-11 -1.13644e-15 -1233.93 3.18917
    3.21294 0.00112749 -5.75615e-07 1.31388e-09 -8.76855e-13 -1005.25 6.03474
    1.67212e-06 170.672
H2O H2O 1   18.0153
    200 5000    1000
    2.67215 0.00305629 -8.73026e-07 1.201e-10 -6.39162e-15 -29899.2 6.86282
    3.38684 0.00347498 -6.3547e-06 6.96858e-09 -2.50659e-12 -30208.1 2.59023
    1.67212e-06 170.672
CH4 CH4   1   16.0428
    200 6000    1000
    1.63543 0.0100844 -3.36924e-06 5.34973e-10 -3.15528e-14 -10005.6 9.9937
    5.14988 -0.013671 4.91801e-05 -4.84744e-08 1.66694e-11 -10246.6 -4.64132
    1.67212e-06 170.672
C3H8 C3H8 1 44.0962
    200 5000 1000
    7.5341368 0.018872239 -6.2718491e-06 9.1475649e-10 -4.7838069e-14 -16467.516 -17.892349
    0.93355381 0.026424579 6.1059727e-06 -2.1977499e-08 9.5149253e-12 -13958.52 19.201691
    1.67212e-06 170.672
CORRUGATED CORRUGATED 1 115.82
    200 5000 1000
    7.5341368 0.018872239 -6.2718491e-06 9.1475649e-10 -4.7838069e-14 -16467.516 -17.892349
    0.93355381 0.026424579 6.1059727e-06 -2.1977499e-08 9.5149253e-12 -13958.52 19.201691
    1.67212e-06 170.672
CH2O CH2O 1 30.02628 
    200 6000 1000
    3.1694807 0.0061932742 -2.2505981e-06 3.6598245e-10 -2.201541e-14 -14478.425 6.0423533
    4.7937036 -0.0099081518 3.7321459e-05 -3.7927902e-08 1.3177015e-11 -14308.955 0.60288702
    1.67212e-06 170.672
CO2 CO2 1   44.01
    200 5000    1000
    4.45362 0.00314017 -1.27841e-06 2.394e-10 -1.66903e-14 -48967 -0.955396
    2.27572 0.00992207 -1.04091e-05 6.86669e-09 -2.11728e-12 -48373.1 10.1885
    1.67212e-06 170.672
N2 N2   1   28.0134
    200 5000    1000
    2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053
    3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037
    1.67212e-06 170.672
)

