trunk/fireFoam/testBatteryFireFOAM/wallFireSpread2D/system/burner.setSet
faceSet burnerFace new boxToFace (-0.1 -0.1 -0.1)(0.201 2.51 0.01)
